; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v3 - type_1 ?v7 - type_3)
 	      (pred_2 ?v1 - object ?v7 - type_3)
	      (pred_3 ?v3 - type_1 ?v4 - type_2)
	      (pred_4 ?v3 - type_1 ?v1 - object ?v4 - type_2))

   (:action op_1
       :parameters  (?v3 - type_1 ?v8 ?v5 - type_3)
       :precondition (and  (pred_1 ?v3 ?v8))
       :effect (and  (pred_1 ?v3 ?v5)
		     (not (pred_1 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_1 ?v2 - object ?v6 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v6) (pred_1 ?v3 ?v6) (pred_3 ?v3 ?v4))
       :effect (and (pred_4 ?v3 ?v2 ?v4)
		    (not (pred_2 ?v2 ?v6)) 
		    (not (pred_3 ?v3 ?v4))))

   (:action op_3
       :parameters (?v3 - type_1 ?v2 - object ?v6 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v2 ?v4) (pred_1 ?v3 ?v6))
       :effect (and (pred_2 ?v2 ?v6)
		    (pred_3 ?v3 ?v4)
		    (not (pred_4 ?v3 ?v2 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_03 - type_1
obj_12 obj_10 obj_04 obj_05 - type_2
obj_01 obj_07 obj_09 - type_3
obj_11 obj_02 obj_06 - object)
(:init
(pred_1 obj_08 obj_07)
(pred_3 obj_08 obj_12)
(pred_3 obj_08 obj_10)
(pred_1 obj_03 obj_07)
(pred_3 obj_03 obj_04)
(pred_3 obj_03 obj_05)
(pred_2 obj_11 obj_09)
(pred_2 obj_02 obj_07)
(pred_2 obj_06 obj_09)
)
(:goal
(and
(pred_2 obj_11 obj_01)
(pred_2 obj_02 obj_07)
(pred_2 obj_06 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_09)))
)
)

; plan
1. (op_1 obj_08 obj_07 obj_01)
   deleted: (pred_1 obj_08 obj_07)
   added: (pred_1 obj_08 obj_01)
   goals met: 2 of 3
2. (op_1 obj_03 obj_07 obj_09)
   deleted: (pred_1 obj_03 obj_07)
   added: (pred_1 obj_03 obj_09)
   goals met: 2 of 3
3. (op_2 obj_03 obj_11 obj_09 obj_05)
   deleted: (pred_2 obj_11 obj_09) (pred_3 obj_03 obj_05)
   added: (pred_4 obj_03 obj_11 obj_05)
   goals met: 2 of 3
4. (op_1 obj_03 obj_09 obj_01)
   deleted: (pred_1 obj_03 obj_09)
   added: (pred_1 obj_03 obj_01)
   goals met: 2 of 3
5. (op_3 obj_03 obj_11 obj_01 obj_05)
   deleted: (pred_4 obj_03 obj_11 obj_05)
   added: (pred_2 obj_11 obj_01) (pred_3 obj_03 obj_05)
   goals met: 3 of 3
